app/views/home/_dashboard.html.erb

					</p>
					<p class="subtitle is-6"><%= team.users.count %> Members</p>
					<span class="f6"><%= safe_join(team.users.map { |user| user.name }, ', ') %></span>
---
SELECT "users".* FROM "users" WHERE "users"."team_id" = ?  [["team_id", 1]]
SELECT COUNT(*) FROM "users" WHERE "users"."team_id" = ?  [["team_id", 1]]