app/views/projects/_form.html.erb


    <% if !current_user.team_id.blank? %>
---
SELECT "teams".* FROM "teams" WHERE (id = 2)