app/controllers/home_controller.rb

  def index
  	if user_signed_in?
  		@teams = Team.where('id = ?', current_user.team_id)
  		@projects = Project.where('team_id = ?', current_user.team_id)
  	end

  	@activities = PublicActivity::Activity.order("created_at DESC").where(owner_id: current_user, owner_type: "User")
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "projects".* FROM "projects" WHERE (team_id = NULL)
SELECT "activities".* FROM "activities" WHERE "activities"."owner_id" = ? AND "activities"."owner_type" = ? ORDER BY created_at DESC  [["owner_id", 5], ["owner_type", "User"]]