app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" ORDER BY created_at DESC
---
  def index
    @projects = Project.all.order("created_at DESC")

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def new
    @project = current_user.projects.build
    @teams = Team.where('id = ?', current_user.team_id)

INSERT INTO "projects" ("name", "description", "created_at", "updated_at", "user_id", "team_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Thesis"], ["description", "asdfasdfasdfasdf"], ["created_at", "2020-05-28 09:23:42.877199"], ["updated_at", "2020-05-28 09:23:42.877199"], ["user_id", 5], ["team_id", 2]]
---
  def create
    @project = current_user.projects.build(project_params)

    respond_to do |format|
      if @project.save