app/controllers/teams_controller.rb

SELECT "teams".* FROM "teams" ORDER BY created_at DESC
---
  def index
    @teams = Team.all.order("created_at DESC")

INSERT INTO "teams" ("name", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["name", "Team musk"], ["created_at", "2020-05-24 17:44:11.387585"], ["updated_at", "2020-05-24 17:44:11.387585"], ["user_id", 5]]
INSERT INTO "users" ("email", "confirmation_token", "confirmation_sent_at", "created_at", "updated_at", "name", "team_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @team = current_user.teams.build(team_params)
    @team.users << current_user

    respond_to do |format|
      if @team.save

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_team
      @team = Team.find(params[:id])